In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns # For plotting 

import warnings
warnings.filterwarnings("ignore")

In [3]:
cd

C:\Users\HP

In [4]:
data = pd.read_csv("mydata.csv")
data.drop(['New_Price'],axis=1,inplace=True)

test = pd.read_csv("mydata_test.csv")
test.drop(['New_Price'],axis=1,inplace=True)

In [5]:
data['Mileage'] = data['Mileage'].str.replace('kmpl', '')
data['Mileage'] = data['Mileage'].str.replace('km/kg', '')

test['Mileage'] = test['Mileage'].str.replace('kmpl', '')
test['Mileage'] = test['Mileage'].str.replace('km/kg', '')

In [6]:
data['Engine'] = data['Engine'].str.replace('CC', '')
data['Power'] = data['Power'].str.replace('bhp', '')

test['Engine'] = test['Engine'].str.replace('CC', '')
test['Power'] = test['Power'].str.replace('bhp', '')

In [7]:
data['Mileage']=data['Mileage'].astype('float64')
data['Engine'] = data['Engine'].astype('float64')
#data['Power'] = data['Power'].astype('float64')

test['Mileage']=test['Mileage'].astype('float64')
test['Engine'] = test['Engine'].astype('float64')
#data['Power'] = data['Power'].astype('float64')

In [8]:
data.sample(2)

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
4379,Audi A4 2.0 TDI Multitronic,Delhi,2011,58000,Diesel,Automatic,First,16.55,1968.0,140,5.0,11.0
4844,Maruti Wagon R VXI 1.2,Kolkata,2014,37000,Petrol,Manual,First,21.50,1197.0,81.80,5.0,2.8

In [9]:
data.loc[data.Seats == 0, ['Seats']] = 5

In [10]:
data[data['Seats']==2].head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,Price
134,Mercedes-Benz SLC 43 AMG,Kolkata,2017,13372,Petrol,Automatic,First,19.0,2996.0,362.07,2.0,54.00
557,Audi TT 2.0 TFSI,Delhi,2013,12100,Petrol,Automatic,First,9.9,1984.0,207.8,2.0,29.50
693,Mercedes-Benz SLK-Class SLK 350,Coimbatore,2016,22732,Petrol,Automatic,First,18.1,3498.0,306,2.0,55.54
798,Mercedes-Benz SLK-Class SLK 350,Bangalore,2015,10000,Petrol,Automatic,First,18.1,3498.0,306,2.0,55.00
915,Smart Fortwo CDI AT,Pune,2008,103000,Diesel,Automatic,Second,0.0,799.0,null,2.0,3.00

In [11]:
company=[]
for x in data['Name']:
    company.append(x.partition(' ')[0])

In [12]:
brand=[]
for x in test['Name']:
    brand.append(x.partition(' ')[0])

In [13]:
da = pd.DataFrame(company,columns=['company']) 
data['company'] = da.iloc[:,0]

In [14]:
das = pd.DataFrame(brand,columns=['brand']) 
test['company'] = das.iloc[:,0]

In [15]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6019 entries, 0 to 6018
Data columns (total 13 columns):
Name                 6019 non-null object
Location             6019 non-null object
Year                 6019 non-null int64
Kilometers_Driven    6019 non-null int64
Fuel_Type            6019 non-null object
Transmission         6019 non-null object
Owner_Type           6019 non-null object
Mileage              6017 non-null float64
Engine               5983 non-null float64
Power                5983 non-null object
Seats                5977 non-null float64
Price                6019 non-null float64
company              6019 non-null object
dtypes: float64(4), int64(2), object(7)
memory usage: 611.4+ KB

In [16]:
data['Power'] = data['Power'].str.strip()
test['Power'] = test['Power'].str.strip()

data['company'] = data['company'].str.strip()
test['company'] = test['company'].str.strip()

In [17]:
data.Power.replace('null', '0.0', inplace = True) # Correcting a spelling error
test.Power.replace('null', '0.0', inplace = True) # Correcting a spelling error

In [18]:
data['Power']=data['Power'].astype('float64')
test['Power'] = test['Power'].astype('float64')

In [19]:
test.head()

,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,company
0,Maruti Alto K10 LXI CNG,Delhi,2014,40929,CNG,Manual,First,32.26,998.0,58.20,4.0,Maruti
1,Maruti Alto 800 2016-2019 LXI,Coimbatore,2013,54493,Petrol,Manual,Second,24.70,796.0,47.30,5.0,Maruti
2,Toyota Innova Crysta Touring Sport 2.4 MT,Mumbai,2017,34000,Diesel,Manual,First,13.68,2393.0,147.80,7.0,Toyota
3,Toyota Etios Liva GD,Hyderabad,2012,139000,Diesel,Manual,First,23.59,1364.0,0.00,5.0,Toyota
4,Hyundai i20 Magna,Mumbai,2014,29000,Petrol,Manual,First,18.50,1197.0,82.85,5.0,Hyundai

In [20]:
data.drop(["Name"],inplace=True,axis=1)
test.drop(["Name"],inplace=True,axis=1)

In [21]:
#data[data["Fuel_Type"]=='Electric'].drop()
data_to_drop_index = data[data["Fuel_Type"]=='Electric'].index.values
data.drop(data_to_drop_index, inplace = True)

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 6017 entries, 0 to 6018
Data columns (total 12 columns):
Location             6017 non-null object
Year                 6017 non-null int64
Kilometers_Driven    6017 non-null int64
Fuel_Type            6017 non-null object
Transmission         6017 non-null object
Owner_Type           6017 non-null object
Mileage              6017 non-null float64
Engine               5981 non-null float64
Power                5981 non-null float64
Seats                5975 non-null float64
Price                6017 non-null float64
company              6017 non-null object
dtypes: float64(5), int64(2), object(5)
memory usage: 611.1+ KB

In [23]:
from sklearn.preprocessing import LabelEncoder

In [24]:
columns = ['company','Owner_Type','Transmission','Fuel_Type','Location']

def encoder(df):
    for col in columns:
        label_encoder = LabelEncoder()
        label_encoder.fit(df[col])
        df[col] = label_encoder.transform(df[col])
    return df

In [84]:
data = encoder(data)
test = encoder(test)

In [85]:
Y = data["Price"]
X = data.drop(["Price"],axis=1)
x = test

In [92]:
from lightgbm import LGBMRegressor
from sklearn.model_selection import train_test_split

In [93]:
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=0.2,random_state=0)

In [95]:
lgbm = LGBMRegressor( random_state=10, max_depth =10,num_leaves=30, subsample = 0.7, min_child_samples=10,
                      boosting_type='gbdt', objective='regression', reg_lambda=5, n_estimators=200)

In [96]:
lgbm.fit(X_train, y_train)

LGBMRegressor(boosting_type='gbdt', class_weight=None, colsample_bytree=1.0,
       importance_type='split', learning_rate=0.1, max_depth=10,
       min_child_samples=10, min_child_weight=0.001, min_split_gain=0.0,
       n_estimators=200, n_jobs=-1, num_leaves=30, objective='regression',
       random_state=10, reg_alpha=0.0, reg_lambda=5, silent=True,
       subsample=0.7, subsample_for_bin=200000, subsample_freq=0)

In [97]:
y_pred = lgbm.predict(X_test)

In [99]:
from sklearn import metrics
print("lgbms Accuracy: ", metrics.mean_absolute_error(y_test, y_pred))

lgbms Accuracy:  1.50511517199

In [100]:
pred = lgbm.predict(test)

In [101]:
submission = pd.DataFrame({"Price": pred})

In [103]:
submission.to_excel("machinehack_submission/simple_lgbm.xlsx",index=False)